{
  "items": [
    {
      "id": 1,
      "tier": 3,
      "popularity": 3,
      "image": "https://cdn.turningpointplus.org/_uploads/150/images/7CR[1].jpg",
      "artist": "Turning Point",
      "title": "The Seven Churches of Revelation",
      "subtitle": "When Jesus Christ sent messages to seven first-century churches, they were timely and accurate.",
      "description": "<p>But 2,000 years later, in the twenty-first century, those messages can help us and our churches as well. Their primary meaning can have personal application for our lives. But those seven letters also have an uncannyprophetic significance. In this teaching series, Dr. David Jeremiah unpacks the meaning of the seven letters at all three interpretive levels: primary, personal, and prophetic.</p><p>Understanding Christ&rsquo;s view of ancient churches can help our modern churches be more faithful—and help us see that we are nearing the end of this age and Christ&rsquo;s Second Coming to earth.</p>"
    },
    {
      "id": 2,
      "tier": 1,
      "popularity": 8,
      "image": "https://cdn.turningpointplus.org/_uploads/139/images/SFH[1].jpg",
      "artist": "Turning Point",
      "title": "Searching for Heaven on Earth",
      "subtitle": "",
      "description": "<p>Through the study and application of the treasures in the book of Ecclesiastes, we can learn much about the school of life as we listen to the voice and wisdom of Solomon.</p><p>In <em>Searching for Heaven on Earth</em>, Dr. Jeremiah goes verse by verse through Ecclesiastes. He explains Solomon&rsquo;s observations and implementations and shows how they failed--until Solomon&rsquo;s last observation gets it right. Let Solomon be your guide as you learn what doesn&rsquo;t bring meaning in life--and what does.</p>"
    },
    {
      "id": 3,
      "tier": 2,
      "popularity": 6,
      "image": "https://cdn.turningpointplus.org/_uploads/210/images/CIJ.jpg",
      "artist": "Turning Point",
      "title": "Count It All Joy",
      "subtitle": "The apostle Paul&rsquo;s most personal letter was sent to the Christians of Philippi.",
      "description": "<p>This intimate and loving epistle was written to believers who lived in the shadow of the Roman tyrant, Nero. Paul was in a Roman prison, facing an uncertain future and yet he wrote of the importance of joy. In <em>Count It All Joy</em>, Dr. David Jeremiah leads you through the Book of Philippians so that you too can experience the joy of the Lord in your daily life.</p>"
    },
    {
      "id": 4,
      "tier": 1,
      "popularity": 9,
      "image": "https://cdn.turningpointplus.org/_uploads/214/images/FRW.jpg",
      "artist": "Turning Point",
      "title": "Forward",
      "subtitle": "Discovering God&rsquo;s Presence and Purpose in Your Tomorrow",
      "description": "<p>Everyone offers a plan on how you should move forward in life. But before you get started, you should know GOD&rsquo;S plan!.</p><p>Imagine a tomorrow where you discover your God-given purpose, maximize your mindset, easily prioritize your time, overcome your fears, outlive your life, fulfill your purpose, and receive your eternal reward! Wouldn&rsquo;t that be amazing?</p><p>The steps to discovering God&rsquo;s presence and purpose in your life present a pathway forward no matter who you are, what your age, what your circumstances, or what you desire to do. Let <em>Forward</em> be your step-by-step plan of action that helps you move past where you are to where you want to be.</p>"
    },
    {
      "id": 5,
      "tier": 1,
      "popularity": 4,
      "image": "https://cdn.turningpointplus.org/_uploads/temp-1668555874/images/WTN.png",
      "artist": "Turning Point",
      "title": "Why the Nativity?",
      "subtitle": "25 Compelling Reasons We Celebrate the Birth of Jesus",
      "description": "<p>In our culture today, it is common for people to forget the true meaning of Christmas - and its significance. The celebration of Christmas is much bigger than a secularized holiday. Christmas is about God&rsqup;s plan of salvation, which He set in motion before time began. In <em>Why the Nativity?</em>, we will discover how the most minute details of Christ&rsquo;s coming were foretold in Old Testament prophecies. We will see that from the Davidic lineage of Jesus and His Virgin birth, to the worship by angelic hosts, common shepherds and wise men, that God was pointing us to the birth of the Messiah.</p>"
    },
    {
      "id": 6,
      "tier": 2,
      "popularity": 5,
      "image": "https://cdn.turningpointplus.org/_uploads/17645/images/christmas-messages2.png",
      "artist": "Turning Point",
      "title": "David Jeremiah&rsquo;s Christmas Messages",
      "subtitle": "",
      "description": "<p>Enjoy this comprehensive collection of messages preached by Dr. David Jeremiah, that center around the meaning of Christmas and the hope we have because Christ became flesh.</p>"
    },
    {
      "id": 7,
      "tier": 3,
      "popularity": 7,
      "image": "https://cdn.turningpointplus.org/_uploads/temp-1655332094/images/A-Heart-of-Thanksgiving.jpg",
      "artist": "Turning Point",
      "title": "A Heart of Thanksgiving",
      "subtitle": "",
      "description": "<p>As Christians, we are called to be thankful in all things. These messages from Dr. David Jeremiah remind us of the blessings that are available to us at all times, in all circumstances. Whether we are gathered around our family at Thanksgiving time or in the midst of loneliness and stress, we can learn how to turn our thoughts to God and genuinely say, &ldquo;Thank you.&rdquo;</p>"
    },
    {
      "id": 8,
      "tier": 1,
      "popularity": 2,
      "image": "https://cdn.turningpointplus.org/_uploads/142/images/SLU[1].jpg",
      "artist": "Turning Point",
      "title": "Someone Like You",
      "subtitle": "The Life of Elijah",
      "description": "<p>It is easy to think of biblical heroes like Elijah in super-human terms — especially when he had the ability to call down fire from heaven.</p><p>But in James 5:17, we read that Elijah in particular &ldquo;was a man with a nature like ours.&rdquo; He performed incredible miracles exhibiting the power of God, while he himself exhibited ordinary, human characteristics. In other words, he was someone like you!</p><p>Dr. David Jeremiah examines the ministry of Elijah in <em>Someone Like You</em>, showing us how Elijah continuously followed the leading of the Lord in his life. Through this study, be amazed at how much you have in common with the prophet Elijah, and be ready for God&rsquo;s leading in your own life.</p>"
    },
    {
      "id": 9,
      "tier": 1,
      "popularity": 1,
      "image": "https://cdn.turningpointplus.org/_uploads/temp-1666127596/images/WTE[1][1].png",
      "artist": "Turning Point",
      "title": "The World of the End",
      "subtitle": "Doesn&rsquo;t it seem as if the hits keep coming both harder and closer together? Our world is packed with lies and loss of trust. Wars and rumors of war. Devastation and disaster. Pressure and persecution. Lawlessness and lovelessness. In this series, Dr. David Jeremiah walks you through Matthew 24:1&ndash;14, a portion of the Olivet Discourse, and focuses your attention on what Jesus has promised to you and how to live for Him in the World of the End.",
      "description": "<p></p>"
    }
  ]
}
